Module 模块_任务名称

    Friend 任务名称_登录,
               任务名称_注册,
               任务名称_验证,
               任务名称_忘记,
               任务名称_重设 As String

    Friend 任务名称_注销,
               任务名称_用户名,
               任务名称_账户,
               任务名称_图标,
               任务名称_密码,
               任务名称_邮箱地址,
               任务名称_手机号,
               任务名称_验证邮箱地址,
               任务名称_验证手机号,
               任务名称_获取密钥,
               任务名称_添加黑域,
               任务名称_添加白域,
               任务名称_移除黑域,
               任务名称_移除白域 As String

    Friend 任务名称_添加讯友,
               任务名称_删除讯友,
               任务名称_清理黑名单,
               任务名称_重命名标签 As String

    Friend 任务名称_发送图片,
               任务名称_发送原图,
               任务名称_发送照片,   '摄像头拍摄后立即发送
               任务名称_发送短视频,   '摄像头录制后立即发送
               任务名称_发送文件,
               任务名称_添加新标签,
               任务名称_添加现有标签,
               任务名称_移除标签,
               任务名称_备注,
               任务名称_拉黑 As String

    Friend 任务名称_创建小聊天群,
               任务名称_创建大聊天群,
               任务名称_加入大聊天群,
               任务名称_邀请,
               任务名称_退出聊天群,
               任务名称_昵称,
               任务名称_删减成员,
               任务名称_群名称,
               任务名称_修改角色,
               任务名称_解散聊天群 As String

    Friend 任务名称_发送语音,
               任务名称_发送文字 As String

    Friend 任务名称_连接传送服务器,
               任务名称_小宇宙,
               任务名称_发流星语,
               任务名称_发布商品 As String

    Friend 任务名称_取消,
               任务名称_添加可注册者,
               任务名称_移除可注册者,
               任务名称_商品编辑者,
               任务名称_关闭 As String

    Friend 任务名称_报表,
               任务名称_新传送服务器,
               任务名称_新大聊天群服务器,
               任务名称_小宇宙中心服务器,
               任务名称_备份数据库 As String

End Module
